In [14]:
import pandas as pd

In [16]:
df = pd.read_csv("City Rating.csv")

In [17]:
df

   Unnamed: 0       city  temp10  temp11  empty_temp
0           0         KL      45      12         NaN
1           1         NY      32      30         NaN
2           2    Jakarta      87      45         NaN
3           3      Delhi      67      80         NaN
4           4  Hong Kong      54      60         NaN

In [ ]:
df.drop('Unnamed: 0',axis=1) #axis 1 is columns

In [ ]:
df.drop(4,axis =0) #remove whole rows